Repository: sympy/sympy.github.com
Catalog: i18n/*.po
Languages: fi, fr, pt, ru

source: Main Page
fi: Pääsivu
fr: Page Principale
pt: Página Principal
ru: Главная страница

source: Features
fi: Ominaisuudet
fr: Fonctionnalités
pt: Recursos
ru: Функции

source: Documentation
fi: Dokumentaatio
pt: Documentação
ru: Документация

source: Support
fi: Tuki
pt: Suporte
ru: Поддержка

source: Development
fi: Kehitys
fr: Développement
pt: Desenvolvimento
ru: Разработка

source: Donate
fi: Lahjoita
pt: Doar

source: Online Shell
fi: Online-komentokehoite
fr: Shell en ligne
pt: Terminal Online
ru: Попробовать Online

source: Compute with Gamma
fi: Laske Gamman avulla
pt: Calcular com Gamma

source: Compute
fi: Laske
pt: Calcular

source: Download Now
fi: Lataa nyt
fr: Télécharger maintenant
pt: Faça o Download Agora
ru: Загрузить сейчас

source: Latest Version
fi: Uusin versio
pt: Última Versão

source: Development Version
fi: Kehitysversio
pt: Versão de Desenvolvimento

source: Quick Links
fi: Pikalinkit
fr: Quelques liens
pt: Links Rápidos
ru: Быстрые ссылки

source: Downloads (source tarballs)
fi: Lataukset (lähdekoodin tarball-tiedostot)
fr: Téléchargements (tarballs des sources)
pt: Downloads (código em tarballs)
ru: Загрузки (архивы с исходными текстами)

source: Mailing list
fi: Postituslista
pt: Lista de emails

source: Source code
fi: Lähdekoodi
fr: Code source
pt: Código fonte
ru: Исходный код

source: Issues tracker
fi: Bugiseuranta
fr: Suivi des problèmes
pt: Lista de bugs
ru: Система отслеживания ошибок

source: Introduction to contributing
pt: Introdução para contribuir

source: Try SymPy online now
fi: Kokeile SymPyn online-versiota
fr: Essayez dès maintenant SymPy en ligne
pt: Tente SymPy online agora
ru: Попробуйте поработать с SymPy онлайн

source: Planet SymPy
fi: Planet SymPy-blogi
pt: Planeta SymPy
ru: Планета SymPy

source: IRC channel logs
fi: IRC-kanavan lokitiedostot
pt: Logs do canal IRC

source: Follow Us
fi: Seuraa meitä
pt: Nos Siga

source: This page is open source. Fork <a href="%(url)s">the project on GitHub</a> to edit it.
fi: Tämä sivu on avointa lähdekoodia. Luo haara <a href="%(url)s">projektista GitHubissa</a> muokataksesi sitä.
fr: Cette page est open source. Forkez <a href="%(url)s">le projet sur GitHub</a> pour l’éditer.
pt: Esta página é open source. Fork <a href="%(url)s">o projeto no GitHub</a> para editá-la.
ru: Эта страница с открытым исходным кодом. Для её редактирования сделайте форк <a href="%(url)s">проекта на GitHub</a>.

source: Languages
fi: Kielet
fr: Langues
pt: Linguagens
ru: Язык

source: We are interested in any contribution. There are many ways how you can contribute
fi: Me olemme kiinnostuneita mistä tahansa avustuksesta. On olemassa monta tapaa jolla voit avustaa
pt: Nós estamos interessados em qualquer contribuição. Há várias maneiras em que você pode contribuir

source: If you wrote anything interesting using SymPy, please send us a patch with the code (see below for more information)
fi: Mikäli kirjoitit jotakin kiinnostavaa SymPy-ohjelmistolla, ole hyvä ja lähetä meille muutostiedosto lähdekoodilla (ole hyvä ja katso lisätiedot alla)
pt: Se você escreveu qualquer coisa interessante usando SymPy, por favor nos envie um patch com o código (mais informações abaixo)

source: If you found a bug (or just want to let us know what you think), tell us on the <a href="https://groups.google.com/group/sympy">mailinglist</a>
pt: Se você encontrou um bug (ou só quer nos dar uma opinião), conte-nos pela <a href="https://groups.google.com/group/sympy">lista de emails</a>

source: You can also add a bug report (or a comment) into the <a href="https://github.com/sympy/sympy/issues/">issues</a>.
fi: Voit myös lisätä bugiraportin (tai kommentin) tällä <a href="https://github.com/sympy/sympy/issues/">sivulla</a>.
pt: Você também pode adicionar um bug (ou comentário) na <a href="https://github.com/sympy/sympy/issues/">lista de problemas</a>.

source: You can blog about how you use SymPy
fi: Voit blogata kuinka käytät SymPy-ohjelmistoa
fr: Vous pouvez blogguer à propos de la façon dont vous utilisez Sympy
pt: Como você pode blogar sobre como usar o SymPy
ru: Можно написать в блоге о том, как вы используете SymPy

source: You can help us write documentation (just send us a patch)
fi: Voit avustaa meitä kirjoittamaan dokumentaatiota (lähettämällä meille muutostiedoston)
fr: Vous pouvez nous aider à écrire la documentation (envoyez-nous juste un patch)
pt: Você pode nos ajudar a escrever a documentação (apenas mande um patch)
ru: Можно помочь нам с документацией (просто пришлите патч)

source: You can help people on our <a href="https://groups.google.com/group/sympy">mailinglist</a>
pt: Você pode ajudar outras pessoas na nossa <a href="https://groups.google.com/group/sympy">lista de emails</a>

source: You can help with reviewing patches
fi: Voit avustaa meitä tarkistamalla muutostiedostoja
fr: Vous pouvez aider en passant en revue des patches
pt: Você pode ajudar a revisar patches
ru: Можно помочь нам с рассмотрением патчей

source: You can send us patches with bug fixes or new features
fi: Voit lähettää meille muutostiedostoja joissa on bugikorjauksia tai uusia ominaisuuksia
fr: Vous pouvez nous envoyer des patches pour corriger des bugs ou ajouter de nouvelles fonctionnalités.
pt: Você pode nos enviar patches com correções de bugs ou novos recursos
ru: Можно послать нам патчи с исправлениями ошибок или добавлением новых функций

source: The best way to contribute code or documentation is to send us a patch
fi: Paras tapa avustaa lahjoittamalla lähdekoodia tai dokumentaatiota on lähettämällä meille muutostiedoston
fr: La meilleure façon de contribuer au code ou à la documentation est de nous envoyer un patch.
pt: O melhor jeito de contribuir dom código ou documentação é mandando um patch
ru: Лучший способ внесения своего вклада - прислать нам патч

source: How to Send a Patch
fi: Kuinka lähettää muutostiedosto
fr: Envoyer un patch
pt: Como Mandar um Patch
ru: Как прислать патч

source: The best way is to send a github pull request against the <a href="https://github.com/sympy/sympy">sympy/sympy</a> repository. We'll review it and push it in.
pt: A melhor maneira é enviando um pull request para o repositório <a href="https://github.com/sympy/sympy">sympy/sympy</a>. Nós iremos revisá-lo e integrá-lo

source: If you need help with git, github, pull requests, patches, coding, SymPy or anything related, just send us an email to the <a href="https://groups.google.com/forum/#!forum/sympy">mailinglist</a> or ask on <a href="https://gitter.im/sympy/sympy">Gitter</a>, we'll be happy to help.
fi: Mikäli tarvitset apua gitin, githubin, talletuspyyntöjen, muutostiedostojen, ohjelmoinnin, SymPyn tai minkä tahansa muun asiaan liittyvän kanssa, ole hyvä ja lähetä e-mail <a href="https://groups.google.com/forum/#!forum/sympy">postituslistalle</a> tai kysy <a href="https://gitter.im/sympy/sympy">Gitterissä</a>, autamme mielellämme.
pt: Se você precisa de ajuda com git, github, pull requests, patches, programação, SymPy ou qualquer coisa relacionada, nos envie um email para a <a href="https://groups.google.com/forum/#!forum/sympy">mailinglist</a> ou pergunte no <a href="https://gitter.im/sympy/sympy">Gitter</a>, nós estaremos felizes em ajudar.

source: Also, you can read our instructions <a href="https://github.com/sympy/sympy/wiki/Development-workflow"> how to prepare patches</a> using git and github.
fi: Lisäksi voit lukea ohjeet <a href="https://github.com/sympy/sympy/wiki/Development-workflow"> kuinka valmistella muutostiedostoja</a> käyttäen gitia ja githubia.
pt: Além disso, você pode ler nossas instruções em <a href="https://github.com/sympy/sympy/wiki/Development-workflow"> como preparar patches</a> usando git e github.

source: The github pull request is a preferred method, as that makes it easy for us to review and push the code in. That said, you can also clone the latest git repository (see the link on the right), prepare a branch with your code, upload it somewhere (for example <a href="https://github.com/">github</a>) and send us a link to the <a href="https://groups.google.com/forum/#!forum/sympy">sympy</a> mailinglist, or you can even send us raw patches --- but it will be more work for us to integrate it.
pt: O pull request no github é um método ideal, assim facilitando para nós revisarmos e integrar o código. Sendo assim, você também pode clonar as últimas atualizações no repositório (link à direita), preparar um branch com seu código, enviar para algum lugar (por exemplo <a href="https://github.com/">github</a>) e nos envie um link para <a href="https://groups.google.com/forum/#!forum/sympy">sympy</a> lista de emails, ou você pode até nos enviar patches em arquivos --- mas será mais trabalhoso para nós inegrarmos.

source: SymPy has a broad <a href="https://docs.sympy.org/dev/aboutus.html#sympy-development-team">development team</a>, send us a patch and your name will appear there too.
pt: SymPy tem um grande <a href="https://docs.sympy.org/dev/aboutus.html#sympy-development-team">time de desenvolvimento</a>, nos envie um patch e seu nome aparecerá la tambem.

source: Sources of the Webpages
fi: Sivustojen lähdekoodi
fr: Sources des pages web
pt: Fontes das Páginas Web
ru: Исходные коды вебстраниц

source: Sources of these webpages are at
fi: Näiden sivujen lähdekoodi on osoitteessa
fr: Les sources de ces pages web sont consultables à l'adresse
pt: As fontes dessas páginas web estão em
ru: Исходные коды вебстраниц находятся здесь

source: Feel free to send us patches with improvements.
fi: Älä epäröi lähettää meille parannuksia sisältäviä muutostiedostoja.
fr: N'hésitez pas à nous envoyer des patches proposant des améliorations.
pt: Sinta-se livre para nos enviar patches com melhorias.
ru: Не стесняйтесь присылать нам патчи с улучшениями.

source: Git Repository
fi: Git-repo
fr: Dépôt Git
pt: Repositório Git
ru: Репозиторий Git

source: Main git repository
fi: Gitin pääsäilö
fr: Dépôt git principal
pt: Repositório git principal
ru: Главный репозиторий Git

source: Online access
fi: Online-pääsy
fr: Accès en ligne
pt: Acesso online
ru: Онлайн-доступ

source: The documentation is maintained using the <a href="%(url)s">Sphinx</a> Python documentation generator.
fi: Dokumentaatiotamme ylläpidetään käyttäen <a href="%(url)s">Sphinx</a> Python dokumentaatiogeneraattoria.
fr: La documentation est maintenue grâce au générateur de documentation Python <a href="%(url)s">Sphinx</a>.
pt: A documentação é mantida usando <a href="%(url)s">Sphinx</a>, ogerador de documentação Python.
ru: Документация поддерживается при помощи <a href="%(url)s">Sphinx</a>.

source: You can find it at
fi: Voit löytää sen osoitteesta
fr: Vous le trouverez à l'adresse
pt: Você pode encontrá-la em
ru: Вы можете просмотреть документацию здесь

source: Support SymPy Development
fi: Tue SymPyn kehitystä
pt: Suporte o Desenvolvimento do SymPy

source: All donations will be used strictly to fund SymPy development, by supporting tasks such as developer sprints, improved documentation, fixing bugs, and paying for hosting costs for services such as the <a href="https://live.sympy.org/">SymPy Online Shell</a>.
pt: Todas as doações serão usadas estritamente para financiar o desenvolvimento do SymPy, apoiando tarefas como corridas de desenvolvedores, documentação melhorada, correções de bugs, e pagamentos de custo de host para serviços como o <a href="https://live.sympy.org/">Terminal Online do SymPy</a>.

source: <a href="https://www.flipcause.com/secure/cause_pdetails/MjI2Mw==">DONATE NOW</a>
pt: <a href="https://www.flipcause.com/secure/cause_pdetails/MjI2Mw==">DOE AGORA</a>

source: SymPy will always be 100% open source software, free for all to use, and released under the liberal terms of the modified BSD license.
pt: SymPy sempre será um software 100% open source, livre para todos usarem, e lançado sobre os termos liberais do licença BSD modificada.

source: Our donations are managed by the <a href="https://numfocus.org/">NumFOCUS</a> foundation, which your contribution to the SymPy project. NumFOCUS is a 501(c)3 non-profit foundation, so if you are subject to US Tax law, your contributions will be tax-deductible.
pt: Nossas doações são gerenciadas pela fundação <a href="https://numfocus.org/">NumFOCUS</a>, que é sua contribuição para o projeto SymPy. NumFOCUS é uma fundação sem fins lucrativos, então se você está sujeito à Lei Tributária dos EUA, suas contribuições serão dedutível de imposto.

source: Source Tarballs (Releases)
fi: Lähdekoodin tarball-arkistot (Julkaisu)
fr: Tarballs des sources (Sorties)
pt: Arquivo com as fontes (Lançamentos)
ru: Архивы с исходными кодами (релизы)

source: Old downloads
fi: Vanhat lataukset
pt: Downloads antigos

source: Git Version
fi: Git-versio
fr: Version Git
pt: Versão do git
ru: Версия Git

source: Browse online
fi: Online-selaus
fr: Parcourir en ligne
pt: Explore online
ru: Онлайн-просмотр

source: Core capabilities
fi: Ydinominaisuudet
pt: Capacidades Principais
ru: Основные возможности SymPy:

source: Basic arithmetic:
fi: Perusaritmetiikka:
pt: Aritimética Básica

source: Support for operators such as <code>+</code>, <code>-</code>, <code>*</code>, <code>/</code>, <code>**</code> (power)
fi: Tukee operaattoreita kuten esimerkiksi <code>+</code>, <code>-</code>, <code>*</code>, <code>/</code>, <code>**</code> (potenssi)
pt: Suporta operações como <code>+</code>, <code>-</code>, <code>*</code>, <code>/</code>, <code>**</code> (exponenciação)

source: Simplification
fi: Sievennys
pt: Simplificação
ru: Упрощение

source: Trigonometry
fi: Trigonometria
pt: Trigonometria

source: Polynomials</a>
fi: Polynomit</a>
pt: Polinômios

source: Expansion:
fi: Laajennus:
pt: Expansão:

source: of a polynomial
fi: polynomin
pt: de um polinômio

source: Functions:
fi: Funktiot:
pt: Funções:
ru: Функции

source: <a href="%(trig)s">trigonometric</a>, <a href="%(hyperbolic)s">hyperbolic</a>, <a href="%(exponential)s">exponential</a>, <a href="%(root)s">roots</a>, <a href="%(logarithm)s">logarithms</a>, <a href="%(abs)s">absolute value</a>, <a href="%(spherical)s">spherical harmonics</a>, <a href="%(factorial)s">factorials and gamma functions</a>, <a href="%(zeta)s">zeta functions</a>, <a href="%(polynomial)s">polynomials</a>, <a href="%(special)s">special functions</a>, ...
fi: <a href="%(trig)s">trigonometriset</a>, <a href="%(hyperbolic)s">hyperboliset</a>, <a href="%(exponential)s">eksponentit</a>, <a href="%(root)s">juuret</a>, <a href="%(logarithm)s">logaritmit</a>, <a href="%(abs)s">itseisarvot</a>, <a href="%(spherical)s">harmoniset pallofunktiot</a>, <a href="%(factorial)s">kertomat ja gammafunktiot</a>, <a href="%(zeta)s">zeta-funktiot</a>, <a href="%(polynomial)s">polynomit</a>, <a href="%(special)s">erikoisfunktiot</a>, ...
pt: <a href="%(trig)s">trigonométrica</a>, <a href="%(hyperbolic)s">hiperbólica</a>, <a href="%(exponential)s">exponencial</a>, <a href="%(root)s">raízes</a>, <a href="%(logarithm)s">logarítimos</a>, <a href="%(abs)s">valor absoluto</a>, <a href="%(spherical)s">harmônicos esféricos</a>, <a href="%(factorial)s">fatoriais and funções gamma</a>, <a href="%(zeta)s">funções zeta</a>, <a href="%(polynomial)s">polinômios</a>, <a href="%(special)s">funções especiais</a>, ...

source: Substitution:
fi: Sijoitus:
pt: Substituição:

source: example
fi: esimerkki
pt: exemplo

source: Numbers:
fi: Numerot:
pt: Números
ru: Числа:

source: <a href="%(integer)s">arbitrary precision integers</a>, <a href="%(rational)s">rationals</a>, <a href="%(float)s">and floats</a>
fi: <a href="%(integer)s">mielivaltaisen tarkat kokonaisluvut</a>, <a href="%(rational)s">rationaaliluvut</a>, <a href="%(float)s">ja liukuluvut</a>
pt: <a href="%(integer)s">inteiros de precisão arbitrária</a>, <a href="%(rational)s">racionais</a> <a href="%(float)s">e floats</a>

source: Noncommutative symbols
fi: Epävaihdannaiset
pt: Símbolos não comutativos
ru: Некоммутативные выражения

source: Pattern matching
fi: Kuvion täsmäys
pt: Detecção de Padrões
ru: Проверка соответствия выражения шаблону

source: Polynomials
fi: Polynomit
pt: Polinômios
ru: Многочлены

source: division, gcd, ...
fi: jaollisuus, syt, ...
pt: divisão, gcd (mdc), ...

source: Factorization
fi: Tekijöihin jakaminen
pt: Fatorização
ru: Разложение на множители

source: Square-free decomposition
fi: Neliötön hajotelma
pt: Decomposição de raiz
ru: Разложение, свободное от квадратов

source: Gröbner bases
fi: Gröbnerin kannat
pt: Bases de Gröbner

source: Partial fraction decomposition
fi: Osamurtohajotelma
pt: Decomposição em frações parciais
ru: Разложение на элементарные дроби

source: Resultants
fi: Resultantit
pt: Resultantes

source: Calculus
fi: Differentiaalilaskenta
pt: Cálculo
ru: Вычисления

source: Limits:
fi: Raja-arvot
pt: Limites
ru: Пределы

source: Differentiation
fi: Derivointi:
pt: Diferenciação
ru: Дифференцирование

source: Integration:
fi: Integrointi:
pt: Integração
ru: Интегрирование

source: It uses extended Risch-Norman heuristic
fi: Se käyttää laajennettua Risch-Norman-heuristiikkaa
pt: Usa heurística de Risch-Norman estendida
ru: Интегрирование с использованием алгоритмов Рича-Нормана

source: Taylor (Laurent) series
fi: Taylor (Laurent) - sarjat
pt: Séries de Taylor (Laurent)
ru: Ряды Тейлора (Лорана)

source: Solving equations
fi: Yhtälönratkaisu
pt: Resolvendo equações
ru: Решение уравнений

source: Polynomial equations
fi: Polynomiyhtälöt
pt: Equações polinomiais

source: Algebraic equations
fi: Algebralliset yhtälöt
pt: Equações Algébricas

source: Differential equations
fi: Differentiaaliyhtälöt
pt: Equações diferenciais

source: Difference equations
fi: Differenssiyhtälöt
pt: Relação de recorrência

source: Systems of equations
fi: Yhtälöryhmät
pt: Sistemas de equações
ru: Систем уравнений

source: Diophantine equations:
fi: Diofantoksen yhtälöt
pt: Equações diofantinas

source: Combinatorics
fi: Kombinatoriikka
pt: Combinatória

source: Permutations
fi: Permutaatiot
pt: Permutações

source: Combinations
fi: Kombinaatiot
pt: Combinações

source: Partitions
fi: Ositukset
pt: Partições

source: Subsets
fi: Osajoukot
pt: Subconjuntos

source: Permutation Groups
fi: Permutaatioryhmät
pt: Grupos de permutação

source: Prufer and Gray Codes
fi: Prüfer ja Gray - koodit
pt: Código de Pruger e Gray

source: Discrete math
fi: Diskreetti matematiikka
pt: Matemática discreta

source: Binomial coefficients
fi: Binomikertoimet
pt: Coeficientes binomiais
ru: Биномиальные коэффициенты

source: Summations
fi: Summat
pt: Somatórios

source: Products
fi: Tulot
pt: Produtos
ru: Произведения последовательностей

source: Number theory:
fi: Lukuteoria:
pt: Teoria dos Números
ru: Теория чисел

source: generating prime numbers, primality testing, integer factorization, Diophantine equation solving...
fi: alkulukujen generointi, alkulukutestit, kokonaislukuhajotelmat, diofantoksen yhtälöt...
pt: geração de números primos, teste de número primo, fatoração de inteiros, resolução de equação diofantina...

source: Logic expressions
fi: Loogiset lauseet
pt: Expressões Lógicas
ru: Логические выражения

source: Matrices
fi: Matriisit
pt: Matrizes
ru: Матрицы

source: Basic arithmetic
fi: Perusaritmetiikka
pt: Aritmética básica

source: Eigenvalues/eigenvectors
fi: Ominaisarvot ja ominaisvektorit
pt: Autovalores/autovetores

source: Determinants
fi: Determinantit
pt: Determinantes
ru: Детерминанты

source: Inversion
fi: Käänteismatriisit
pt: Inversão

source: Solving
fi: Ratkaiseminen
pt: Resolução

source: Abstract expressions
fi: Abstraktit lausekkeet
pt: Expressões abstratas

source: Geometric Algebra
fi: Geometrinen algebra
pt: Algebra Geométrica
ru: Геометрическая алгебра

source: Geometry
fi: Geometria
pt: Geometria
ru: Модуль геометрии

source: points, lines, rays, segments, ellipses, circles, polygons, ...
fi: pisteet, suorat, säteet, segmentit, ellipsit, ympyrät, monikulmiot, ...
pt: pontos, linhas, raios, segmentos, elipses, círculos, polígonos, ...

source: Intersection
fi: Leikkaus
pt: Interseção
ru: Пересечение

source: Tangency
fi: Tangentti
pt: Tangência

source: Similarity
fi: Yhdenmuotoisuus
pt: Similaridade
ru: Подобие

source: Plotting
fi: Kuvaajien piirtäminen
pt: Desenhar gráficos
ru: Рисование

source: Coordinate modes
fi: Koordinaattimallit
pt: Modos de coordenadas

source: Plotting Geometric Entities
fi: Geometristen kappaleiden piirtäminen
pt: Desenhando entidades geométricas
ru: Рисование геометрических фигур

source: 2D and 3D
fi: 2D ja 3D
pt: 2D e 3D
ru: Двух- и трёхмерное построение графиков

source: Interactive interface
fi: Interaktiivinen rajapinta
pt: Interface interativa
ru: Интерактивный режим

source: Colors
fi: Värit
pt: Cores
ru: Поддержка цветов

source: Matplotlib support
fi: Matplotlib-tuki
pt: Suporte à Matplotlib

source: SymPy plot of sin(2 sin(2 sin(x))) with matplotlib
fi: Funktion sin(2 sin(2 sin(x))) SymPy-kuvaaja matplotlibin avulla
pt: Gráfico SymPy de sin(2 sin(2 sin(x))) com matplotlib

source: SymPy plot of x, x^2, and x^3 from x = -5 to 5
fi: Funktioiden x, x^2, ja x^3 SymPy-kuvaajat x = -5 ja 5 välillä
pt: Gráfico SymPy de x, x^2 e x^3 de x = -5 até 5

source: SymPy parametric plot of x=cos(u), y=sin(u), u from -5 to 5
fi: Parametrinen x = cos(u), y = sin(u) SymPy-kuvaaja välillä -5, 5
pt: Gráfico paramétrico de x=cos(u), y=sin(u), u de -5 até 5

source: SymPy 3D surface plot of xy, x from -5 to 5, y from 5 to 5
fi: Funktioiden xy, x SymPy 3D-kuvaaja, x välillä -5 ja 5 ja y välillä 5 ja 5
pt: Gráfico SymPy da superfície 3D de xy, x de -5 até 5, y de -5 até 5

source: SymPy 3D parametric line plot of x=cos(u), y=sin(u), z=u, u from -5 to 5
fi: 3D-parametrinen käyrän x = cos(u), y = sin(u), z = u SymPy - kuvaaja välillä -5, 5
pt: Gráfico SymPy da linha paramétrica de x=cos(u), y=sin(u), z=u, u de -5 até 5

source: SymPy 3D parametric surface plot of x=cos(u+v), y=sin(u-v), z=u-v, u and v from -5 to 5
fi: 3D parametrinen SymPy - kuvaaja pinnalle x = cos(u + v), y = sin(u - v), z = u - v jossa u, v välillä -5, 5
pt: Gráfico SymPy da superfície paramétrica de x=cos(u+v), y=sin(u-v), z=u-v, u e v de -5 até 5

source: SymPy implicit plot of x^2 + y^2 = 5
fi: Implisiittinen SymPy - kuvaaja käyrälle x^2 + y^2 = 5
pt: Gráfico SymPy implícito de x^2 + y^3 = 5

source: SymPy implicit plot of y &gt; x^2
fi: Implisiittinen SymPy-kuvaaja y &gt; x^2
pt: Gráfico SymPy implícito de y &gt; x^2

source: SymPy implicit plot of y &gt; x (logical and) y &gt; -x
fi: Implisiittinen SymPy-kuvaaja y &gt; x (looginen ja) y & gt; -x
pt: Gráfico SymPy implícito de y &gt; x (e lógico) y &gt; -x

source: Matplotlib interactive interface of SymPy 3D parametric surface plot of x=cos(u+v), y=sin(u-v), z=u-v, u and v from -5 to 5
fi: Interaktiivinen matplotlib-rajapinta 3D-parametriselle SymPy-pinnalle x=cos(u+v), y = sin(u-v), z=u-v, u ja v välillä -5, 5
pt: Interface interativa do Matplotlip no gráfico SymPy da superfície paramétrica de x=cos(u+v), y=sin(u-v), z=u-v, u e v de -5 até 5

source: SymPy Gamma plot of x=cos(t), y=sin(t)
fi: SymPy Gamma-kuvaaja x=cos(t), y=sin(t)
pt: Gráfico SymPy Gamma de x=cos(t), y=sin(t)

source: SymPy Gamma plot
fi: SymPy Gamma - kuvaaja
pt: Gráfico SymPy Gamma

source: Physics
fi: Fysiikka
pt: Física
ru: Физика

source: Units
fi: Yksiköt
pt: Unidades
ru: Единицы измерения

source: Mechanics
fi: Mekaniikka
pt: Mecânica
ru: Механика

source: Quantum
fi: Kvanttimekaniikka
pt: Física Quântica
ru: Квантовая физика

source: Gaussian Optics
fi: Gaussin optiikka
pt: Óptica Gaussiana
ru: Оптика

source: Pauli Algebra
fi: Paulin algebra
pt: Álgebra de Pauli
ru: Матрицы Паули и Дирака

source: IPython Notebook Examples
fi: IPython - esimerkkimuistiot
pt: Exemplos de IPython Notebooks

source: Beginner Tutorial for SymPy Mechanics
fi: Aloittelijan opas SymPy-mekaniikalle
pt: Tutorial de Mecânica em SymPy para Iniciantes
