Repository: sympy/sympy.github.com
Catalog: i18n/*.po
Languages: fi, fr, pt, ru

source: You can help people on our <a href="http://groups.google.com/group/sympy">mailinglist</a>
fi: Voit avustaa ihmisiä <a href="http://groups.google.com/group/sympy">postituslistalla</a>
fr: Vous pouvez venir en aide à des utilisateurs sur notre <a href="http://groups.google.com/group/sympy">liste de diffusion</a>
ru: Можно помочь людям в нашем <a href="http://groups.google.com/group/sympy">списке рассылки</a>

source: The best way is to send a github pull request against the <a href="http://github.com/sympy/sympy">sympy/sympy</a> repository. We'll review it and push it in.
fi: Paras tapa on lähettää meille talletuspyynnön <a href="http://github.com/sympy/sympy">sympy/sympy</a> keskussäilöön. Me arvioimme ja yhdistämme sen.

source: The github pull request is a preferred method, as that makes it easy for us to review and push the code in. That said, you can also clone the latest git repository (see the link on the right), prepare a branch with your code, upload it somewhere (for example <a href="http://github.com/">github</a>) and send us a link to the <a href="https://groups.google.com/forum/#!forum/sympy">sympy</a> mailinglist, or you can even send us raw patches --- but it will be more work for us to integrate it.
fi: Githubin talletuspyyntö on meille mieluisin tapa, koska se tekee meille helpoksi arvioida ja yhdistää lähdekoodia. Joten, myös voit kloonata viimeisimmän git-säilön (ks. linkki oikealla), valmistella haaran jossa koodisi sijaitsee, ladata sen jonnekin (esimerkiksi <a href="http://github.com/">github</a>) ja lähettää meille linkin <a href="https://groups.google.com/forum/#!forum/sympy">sympy</a> postituslistalle, tai voit jopa lähettää meille raakamuutostiedostoja --- mutta se tietää meille työtä koska meidän pitää integroida muutokset.

source: SymPy has a broad <a href="http://docs.sympy.org/dev/aboutus.html#sympy-development-team">development team</a>, send us a patch and your name will appear there too.
fi: SymPy-projektilla on laaja <a href="http://docs.sympy.org/dev/aboutus.html#sympy-development-team">kehitystiimi</a>, lähetä meille muutostiedosto ja sinun nimesi ilmestyy kehitystiimiimme.

source: SymPy will always be 100% open source software, free for all to use and released under the liberal terms of the modified BSD license.
fi: SymPy tulee aina olemaan 100% avoimen lähdekoodin ohjelmisto, vapaa kaikkien käytettäväksi ja julkaistu sallivilla muokatun BSD-lisenssin ehdoilla.

source: You can donate any amount here:
fi: Voit lahjoittaa minkä tahansa rahasumman täällä:

source: All donations will be used strictly to fund SymPy development, by supporting tasks such as developer sprints, improved documentation, fixing bugs and paying for hosting costs for services such as the <a href="http://live.sympy.org/">SymPy Online Shell</a>.
fi: Kaikki lahjoitukset tullaan käyttämään vain SymPy-kehityksen rahoittamiseen tukemalla tehtäviä kuten kehitys-sprintit, parannettu dokumentaatio, bugikorjaukset ja maksamalla kulut palveluille kuten esimerkiksi <a href="http://live.sympy.org/">SymPy Online</a>.

source: Our donations are managed by the <a href="http://numfocus.org/">NumFOCUS</a> foundation, which passes 100% of your contribution to the SymPy project. NumFOCUS is a 501(c)3 non-profit foundation, so if you are subject to US Tax law, your contributions will be tax-deductible.
fi: Lahjoituksiamme hoitaa <a href="http://numfocus.org/">NumFOCUS</a> säätiö, joka antaa 100% lahjoituksista SymPyn hyväksi. NumFOCUS on 501(c)3 voittoa tavoittelematon säätiö, joten jos olet USA:n verolain alainen, lahjoitukset voidaan vähentää verotuksessa.

source: Downloads
fi: Lataukset
fr: Téléchargements
ru: Загрузки

source: Integration Documentation
fi: Integrointidokumentit

source: <a href="http://deeplearning.net/software/theano/">Theano</a> interaction
fi: <a href="http://deeplearning.net/software/theano/">Theano</a> interaktiot

source: SymPy is a Python library for symbolic mathematics. It aims to become a full-featured computer algebra system (CAS) while keeping the code as simple as possible in order to be comprehensible and easily extensible. SymPy is written entirely in Python and does not require any external libraries.
fi: SymPy on symboliseen matematiikkaan tarkoitettu Python-kirjasto. Se pyrkii tulemaan täysien omainsuuksien laskentaohjelmistoksi (CAS) pitäen koodin mahdollisimman yksinkertaisena ollakseen ymmärrettävä ja helposti laajennettava. SymPy on kirjoitettu kokonaan Python-ohjelmointikielellä eikä vaadi ylimääräisiä kirjastoja.

source: <a href="http://docs.sympy.org/latest/tutorial/index.html">Get started with the tutorial</a>
fi: <a href="http://docs.sympy.org/latest/tutorial/index.html">Pääse alkuun tutoriaaleilla</a>

source: SymPy does not require any external libraries, making it easy to use.
fi: Ainoa ulkoinen kirjasto jonka SymPy tarvitsee on NumPy, joten se on helppo käyttää.

source: SymPy is accepted as a <a href="http://www.google-melange.com/gsoc/org2/google/gsoc2014/sympy">mentoring organization</a> for Google Summer of Code 2014
fi: SymPy on hyväksytty <a href="http://www.google-melange.com/gsoc/org2/google/gsoc2014/sympy">mentorointiorganisaatio</a> Google Summer of Code 2014 - ohjelmalle

source: SymPy is accepted as a <a href="http://www.google-melange.com/gsoc/org/show/google/gsoc2013/sympy">mentoring organization</a> for Google Summer of Code 2013
fi: SymPy on hyväksytty <a href="http://www.google-melange.com/gsoc/org/show/google/gsoc2013/sympy">mentorointiorganisaatio</a> Google Summer of Code 2013 - ohjelmalle

source: SymPy is accepted as a <a href="http://www.google-melange.com/gsoc/org/show/google/gsoc2012/sympy">mentoring organization</a> for Google Summer of Code 2012
fi: SymPy on hyväksytty <a href="http://www.google-melange.com/gsoc/org/show/google/gsoc2012/sympy">mentorointiorganisaatio</a> Google Summer of Code 2012 - ohjelmalle

source: SymPy is accepted as a <a href="http://www.google-melange.com/gsoc/org/show/google/gsoc2011/sympy">mentoring organization</a> for Google Summer of Code 2011
fi: SymPy on hyväksytty <a href="http://www.google-melange.com/gsoc/org/show/google/gsoc2011/sympy">mentorointiorganisaatio</a> Google Summer of Code 2011 - ohjelmalle
fr: SymPy participe au Google Summer of Code 2011 en tant qu'<a href="http://www.google-melange.com/gsoc/org/show/google/gsoc2011/sympy">organisation de mentorat</a>
ru: SymPy стала участником <a href="http://www.google-melange.com/gsoc/org/show/google/gsoc2011/sympy">Google Summer of Code 2011</a>

source: SymPy <a href="http://docs.sympy.org">Documentation</a>
fi: SymPy <a href="http://docs.sympy.org">dokumentaatio</a>

source: Main <a href="http://groups.google.com/group/sympy">mailinglist</a>
fi: Pääasiallinen <a href="http://groups.google.com/group/sympy">postituslista</a>

source: <a href="https://github.com/sympy/sympy/issues/">Issues tracker</a>.
fi: <a href="https://github.com/sympy/sympy/issues/">Bugienseuraaja</a>.

source: IRC channel: <a href="irc://irc.freenode.net/sympy">#sympy at freenode</a>. Note that this channel is <a href="http://colabti.org/irclogger/irclogger_logs/sympy">logged</a>.
fi: IRC-kanava: <a href="irc://irc.freenode.net/sympy">#sympy freenode-verkossa</a>. Huomaathan että tämä kanava on <a href="http://colabti.org/irclogger/irclogger_logs/sympy">logattu</a>.

source: SymPy <a href="http://docs.sympy.org/0.7.1/tutorial.html">tutorial</a>
fi: SymPy <a href="http://docs.sympy.org/0.7.1/tutorial.html">tutoriaali</a>

source: <a href="http://docs.sympy.org/0.7.1/gotchas.html">Gotchas and Pitfalls</a>
fi: <a href="http://docs.sympy.org/0.7.1/gotchas.html">Kompastuskiviä ja Sudenkuoppia</a>

source: Screenshots
fr: Captures d’écran
ru: Скриншоты

source: We are interested in any contribution. There are many ways how you can contribute
fr: Nous sommes intéressés par toutes formes de contribution. Vous pouvez contribuer de diverses façons.
ru: Мы заинтересованы в любом содействии. Свой вклад можно внести многими способами

source: If you wrote anything interesting using SymPy, please send us a patch with the code (see below for more information)
fr: Si vous avez écrit quelque chose d'intéressant utilisant Sympy, n'hésitez pas à nous soumettre un patch avec le code (pour plus d'informations, voir ci-après)
ru: Если вы сделали что-нибудь интересное при помощи SymPy, пришлите нам патч с исходным кодом (ниже описано, как)

source: If you found a bug (or just want to let us know what you think), tell us on the <a href="http://groups.google.com/group/sympy">mailinglist</a>
fr: Si vous avez trouvé un bug (ou si vous souhaitez nous faire part de vos remarques), dites-le nous sur la <a href="http://groups.google.com/group/sympy">liste de diffusion</a>
ru: Если вы нашли ошибку (или просто хотите рассказать нам о том, что вы думаете о SymPy), пишите в <a href="http://groups.google.com/group/sympy">наш список рассылки</a>

source: You can also add a bug report (or a comment) into the <a href="http://code.google.com/p/sympy/issues/list">issues</a>.
fr: Vous pouvez aussi rédiger un rapport de bug ou un commentaire dans le <a href="http://code.google.com/p/sympy/issues/list">système de suivi de problèmes</a>.
ru: Также можно отправить отчёт об ошибке (или добавить комментарий) <a href="http://code.google.com/p/sympy/issues/list">здесь</a>.

source: The best way is to send a github pull request against the <a href="http://github.com/sympy/sympy">sympy/sympy</a> repository. We'll review it and push it in.
fr: La meilleure solution est d'envoyer une requête de pull sur le dépôt github <a href="http://github.com/sympy/sympy">sympy/sympy</a>. Nous le passerons en revue, puis nous l'intègrerons.
ru: Лучше всего создать на GitHub запрос на принятие изменений (pull request) <a href="http://github.com/sympy/sympy">здесь</a>. Мы рассмотрим их и примем в основную ветку.

source: If you need help with git, github, pull requests, patches, coding, SymPy or anything related, just send us an email to the mailinglist or ask on IRC (our channel is <a href="irc://irc.freenode.net/sympy">#sympy at freenode</a>), we'll help.
fr: Si vous avez besoin d'aide concernant git, github, les requêtes de pull, les patches, le code, SymPy ou quoi que ce soit d'autre, envoyez-nous un mail via la liste de diffusion ou posez vos questions sur IRC (notre canal est <a href="irc://irc.freenode.net/sympy">#sympy at freenode</a>) et nous vous aiderons.
ru: Если вам нужна помощь в работе с git, github, запросами на принятие изменений, патчами, написанием кода, с самим SymPy или с чем-то другим, связанным с разработкой, просто задайте свой вопрос в электронном письме в наш список рассылки или в <a href="irc://irc.freenode.net/sympy">нашем IRC чате</a> - мы поможем.

source: Also, you can read our instructions <a href="https://github.com/sympy/sympy/wiki/Development-workflow"> how to prepare patches</a> using git and github.
fr: Vous pouvez aussi lire nos instructions sur <a href="https://github.com/sympy/sympy/wiki/Development-workflow"> comment preparer des patches</a> à l'aide de git et github.
ru: Инструкция по подготовке патчей с помощью git и github находится <a href="https://github.com/sympy/sympy/wiki/Development-workflow">здесь</a>.

source: The github pull request is a preferred method, as that makes it easy for us to review and push the code in. That said, you can also clone the latest git repository (see the link on the right), prepare a branch with your code, upload it somewhere (for example <a href="http://github.com/">github</a>) and send us a link to the <a href="http://groups.google.com/group/sympy-patches">sympy-patches</a> mailinglist, or you can even send us raw patches --- but it will be more work for us to integrate it.
fr: La requête de pull sur github est la méthode privilégiée, car elle nous permet de passer en revue et d'intégrer le code plus aisément. Ceci dit, vous pouvez aussi cloner la dernière version du dépôt git (référez-vous au lien à droite), préparer une branche avec votre code, héberger votre code quelque part (par exemple sur <a href="http://github.com/">github</a>), puis nous envoyer un lien vers la liste de diffusion <a href="http://groups.google.com/group/sympy-patches">sympy-patches</a>. Vous pouvez aussi nous envoyer des patches bruts, mais cela demandera plus de travail pour les intégrer.
ru: Запрос на принятие изменений в GitHub - наиболее предпочитаемый метод, так как это упрощает рассмотрение кода и включение его в репозиторий. Вы можете сделать это таким образом: сделать копию последней редакции в репозитории (ссылка справа), создать ветку со своим кодом, загрузить её куда-нибудь (к примеру, на <a href="http://github.com/">GitHub</a>) и послать нам в <a href="http://groups.google.com/group/sympy-patches">список рассылки</a> ссылку. Еще лучше проследовать инструкции по подготовке патчей, чтобы отправить нам запрос на внесение изменений. Можно посылать необработаные патчи, но это займёт больше усилий для включения в репозиторий.

source: SymPy has a broad development team: <a href=" http://docs.sympy.org/0.7.1/aboutus.html#sympy-development-team "> http://docs.sympy.org/0.7.1/aboutus.html#sympy-development-team </a>, send us a patch and your name will appear there too.
fr: SymPy dispose d'une grande équipe de développement: <a href=" http://docs.sympy.org/0.7.1/aboutus.html#sympy-development-team "> http://docs.sympy.org/0.7.1/aboutus.html#sympy-development-team </a>, envoyez-nous un patch et votre nom apparaîtra ici.
ru: У SymPy <a href="http://docs.sympy.org/0.7.1/aboutus.html#sympy-development-team">большая команда разработчиков</a>. Пришлите нам патч и ваше имя окажется в этом же списке.

source: at Google Code page
fr: depuis la page Google Code
ru: на Google Code

source: Packages for Distributions
fr: Paquets pour les Distributions
ru: Пакеты для дистрибутивов

source: SymPy is a Python library for symbolic mathematics. It aims to become a full-featured computer algebra system (CAS) while keeping the code as simple as possible in order to be comprehensible and easily extensible. SymPy is written entirely in Python and does not require any external libraries.
fr: SymPy est une bilibothèque Python pour les mathématiques symboliques. Elle vise à devenir un système de calcul formel complet tout en gardant le code aussi simple que possible afin d'être compréhensible et facilement extensible. SymPy est écrite entièrement en Python et ne requiert aucune bibliothèque externe.
ru: SymPy - библиотека Python для символьных вычислений. Она призвана стать полнофункциональной системой компьютерных расчётов (CAS), но при этом сохраняет простоту кода и расширяемость. Она полностью написана на Python и не требует других внешних библиотек.

source: Basic arithmetics:
ru: Базовая арифметика

source: Support for operators such as <code>+</code>, <code>-</code>, <code>*</code>, <code>/</code>, <code>**</code> (power)
ru: Поддержка операторов <code>+</code>, <code>-</code>, <code>*</code>, <code>/</code>, <code>**</code> (power)

source: Expansion
ru: Раскрытие выражений

source: trigonometric, cyclometric, hyperbolic, aera hyperbolic, exponential, roots, logarithms, absolute value, spherical harmonics, factorials and gamma functions, zeta functions, polynomials
ru: тригономертрические, цикломатические, гиперболические, aera hyperbolic, экспоненты, корни, логарифмы, абсолютное значение, сферические функции, факториалы и Гамма-функция, Дзета-функции, полиномы

source: Substitution
ru: Подстановки

source: arbitraty precision integers, rationals and floats, complex numbers
ru: операции с целыми и действительными числами произвольной точности

source: Division
ru: Деление

source: Greatest Common Divisior, Least Common Multiple
ru: Наибольший общий делитель, наименьшее общее кратное

source: Groebner bases
ru: Базис Грёбнера

source: Algebraic Equations
ru: Алгебраических

source: Difference and differential Equations
ru: Дифференциальные и разностных

source: Discrete maths
ru: Дискретная математика

source: Sums
ru: Суммы последовательностей

source: generating prime numbers, smooth numbers, multiplicity, perfect powers, prime factors
ru: вычисление простых чисел, гладкие числа, multiplicity, совершенные степени, простые множители

source: Arithmetic operations
ru: Арифметические операции

source: Vector operations
ru: Операции над векторами

source: Обращение
ru: Версия Git

source: Entities:
ru: Фигуры:

source: point, line, ray, segment, ellipse, circle, polygon, regular polygon, triangle
ru: точка, прямая, луч, сектор, эллипс, окружность, многоугольники, простой многоугольник, треугольник

source: Checking tangency
ru: Проверка касания

source: Releases
fr: Sorties
ru: Релизы

source: Google Code downloads
fr: Téléchargements Google Code
ru: Загрузки на Google Code

source: Latest git version
fr: Dernière version git
ru: Последняя git версия

source: Downloads (packages for distributions)
fr: Téléchargements (paquets pour les distributions)
ru: Загрузки (пакеты для дистрибутивов)

source: Mailinglist
fr: Liste de diffusion
ru: Список рассылки

source: Google Code Page
fr: Page Google Code
ru: Страница на Google Code

source: Wiki
ru: Вики

source: Python Session
fr: Session Python
ru: Python

source: ISymPy Session
fr: Session ISymPy
ru: ISymPy

source: SymPy core capabilities include:
fr: Les fonctionnalités de base de SymPy incluent:

source: basic arithmetics
fr: l'arithmétique de base

source: basic simplification
fr: les bases de la simplification

source: like
fr: comme

source: expansion
fr: le développement

source: functions
fr: les fonctions

source: complex numbers
fr: les nombres complexes

source: differentiation
fr: la dérivation

source: taylor (laurent) series
fr: les séries de Taylor (Laurent)

source: substitution
fr: la substitution

source: or
fr: ou

source: arbitrary precision integers, rationals and floats
fr: les entiers, rationnels et flottants à précision arbitraire

source: noncommutative symbols
fr: les symboles non commutatifs

source: pattern matching
fr: la correspondance de motifs

source: Then there are SymPy modules for these tasks:
fr: Les modules SymPy suivants sont disponibles pour ces tâches:

source: more functions (sin, cos, tan, atan, asin, acos, factorial, zeta, legendre)
fr: plus de fonctions (sin, cos, tan, atan, asin, acos, factorielle, zeta, legendre)

source: limits
fr: limites

source: integration using extended Risch-Norman heuristic
fr: intégration utilisant l'algorithme étendu de Risch-Norman

source: polynomials (division, gcd, square free decomposition, groebner bases, factorization)
fr: polynômes (division, pgcd, décomposition sans facteur carré, bases de Gröbner, factorisation)

source: solvers (algebraic, difference and differential equations, and systems of equations)
fr: résolutions d'équations (équations polynomiales, relations de récurrence, équations différentielles et systèmes d'équations)

source: symbolic matrices (determinants, LU decomposition...)
fr: matrices symboliques (déterminants, décomposition LU...)

source: mpmath (multiprecision floating-point arithmetic)
fr: mpmath (arithmétique flottante multiprécision)

source: geometric algebra (GA)
fr: algèbre géométrique

source: Pauli and Dirac algebra
fr: Algèbre de Pauli et Dirac

source: quantum physics
fr: physique quantique

source: geometry module
fr: module de géométrie

source: plotting (2D and 3D)
fr: graphes (2D et 3D)

source: code generation (C, Fortran, LaTeX)
fr: génération de code (C, Fortran, LaTeX)
