Repository: sympy/sympy.github.com
Catalog: i18n/*.po
Languages: fi, fr, pt, ru

source: Deriving the Mass-Spring-Damper System with SymPy
fi: Massa-Jousi-Vaimennin - järjestelmän johtaminen SymPyn avulla
pt: Derivando o Sistema Massa-Mola-Amortecedor com SymPy

source: Quantum Circuit Plotting with SymPy
fi: Kvanttipiirien kuvaaminen SymPyn avulla
pt: Desenhando Gráficos de Circuito Quântico com SymPy

source: Statistics
fi: Tilastotiede
pt: Estatística
ru: Статистика

source: Random variable types:
fi: Satunnaismuuttujien tyypit:
pt: Tipos de variável aleatória:

source: Normal distributions
fi: Normaalijakaumat
pt: Distribuições normais
ru: Пакеты для дистрибутивов

source: Uniform distributions
fi: Tasajakaumat
pt: Distribuições uniformes
ru: Непрерывное равномерное распределение

source: Bernoulli distributions
fi: Bernoulli-jakaumat
pt: Distribuições de Bernoulli

source: Binomial distributions
fi: Binomijakaumat
pt: Distribuições Binomiais

source: Hypergeometric distributions
fi: Hypergeometriset jakaumat
pt: Distribuições Hipergeométricas

source: More&hellip;
fi: Lisää&hellip;
pt: Mais&hellip;

source: Probability
fi: Todennäköisyys
pt: Probabilidade
ru: Теория вероятностей

source: Expected value and variance
fi: Odotusarvo ja varianssi
pt: Valor esperado e variância

source: Probability density
fi: Todennäköisyyden tiheysfunktio
pt: Densidade de probabilidade

source: Cryptography
fi: Kryptografia
pt: Criptografia

source: Shift cipher
fi: Siirtosalaus
pt: Cifra de Troca (Cífra de César)

source: Affine cipher
fi: Affiini salaus
pt: Cifra

source: Bifid ciphers
fi: Bifid-salaus
pt: Cifra de Bifid

source: Vigenere’s cipher
fi: Vinegeren salaus
pt: Cifra de Vigenere

source: Substitution ciphers
fi: Korvaussalaus
pt: Cifras de Substituição

source: Hill’s cipher
fi: Hillin salaus
pt: Cifra de Hill

source: Linear feedback shift registers
fi: Vaihtorekisterien lineaarinen palaute
pt: Registrador de deslocamento com realimentação linear

source: ElGamal encryption
fi: ElGamal-salaus
pt: Criptografia ElGamal

source: Parsing
fi: Jäsennys
pt: Análise Sintática

source: Conversion from Python objects to SymPy objects
fi: Python-olioiden kääntäminen SymPy-olioiksi
pt: Conversão de objetos Python para objetos SymPy

source: Optional implicit multiplication and function application parsing
fi: Valinnainen implisiittinen moninkertaistuminen ja funktion sovellusjäsennys
pt: Multiplicação implícita opcional e análise de aplicativo de função

source: Limited Mathematica and Maxima parsing:
fi: Rajoitettu Mathematica ja Maxima - jäsennys
pt: Análise sintática limitada de Mathematica e Maxima:

source: example on SymPy Live
fi: esimerkki SymPy-livessä
pt: exemplo em SymPy Live

source: Custom parsing transformations
fi: Sovitetut jäsennysmuutokset
pt: Transformações peronalizadas de análises

source: Printing
fi: Tulostaminen
pt: Impressão
ru: Печать

source: Pretty printing:
fi: Kaunis tulostaminen:
pt: Impressão bonita
ru: Красивая печать (Pretty-printing)

source: ASCII/Unicode pretty printing, LaTeX
fi: ASCII/Unicode kaunis tulostaminen, LaTeX
pt: Impressão bonita de ASCII/Unicode, LaTeX
ru: Печать с использованием ASCII или Unicode символов. Печать в формате LaTeX

source: Code generation:
fi: Koodin generointi:
pt: Geração de código:
ru: Генерация кода

source: <a href="https://deeplearning.net/software/theano/">Theano</a> interaction
pt: Interação com <a href="https://deeplearning.net/software/theano/">Theano</a>

source: Unicode printing in a Python shell
fi: Unicode-tulostaminen Python-komentokehoitteella
pt: Impressão Unicode em um terminal Python

source: Unicode printing
fi: Unicode-tulostaminen
pt: Impressão Unicode

source: LaTeX printing in an IPython notebook
fi: LaTeX-tulostaminen IPython - muistiossa
pt: Impressão LaTeX em um IPython notebook

source: LaTeX printing
fi: LaTeX-tulostaminen
pt: Impressão Latex

source: About
fi: Tietoja
fr: À propos
pt: Sobre
ru: О SymPy

source: SymPy is a Python library for symbolic mathematics. It aims to become a full-featured computer algebra system (CAS) while keeping the code as simple as possible in order to be comprehensible and easily extensible. SymPy is written entirely in Python.
pt: SymPy é uma biblioteca Python para matemática simbólica. Almejamos nos tornar um sistema de álgebra computacional (CAS) completo mantendo o código o mais simples possível para ser compreensível e fácilmente estendido. SymPy é escrito inteiramente em Python.

source: <a href="https://docs.sympy.org/latest/tutorial/index.html">Get started with the tutorial</a>
pt: <a href="https://docs.sympy.org/latest/tutorial/index.html">Comece com o tutorial</a>

source: <a href="https://github.com/sympy/sympy/releases">Download Now</a>
fi: <a href="https://github.com/sympy/sympy/releases">Lataa nyt</a>
pt: <a href="https://github.com/sympy/sympy/releases">Faça o Download Agora</a>

source: Why SymPy
fi: Miksi SymPy
pt: Porque SymPy

source: SymPy is&hellip;
fi: SymPy on&hellip;
pt: O SymPy é&hellip;

source: Free:
fi: Vapaa:
pt: Grátis

source: Licensed under BSD, SymPy is free both as in speech and as in beer.
fi: Lisensioitu BSD-lisenssillä, SymPy on vapaa ja ilmainen
pt: Licenciado sobre BSD, SymPy é grátis tanto na fala quanto na cerveja.

source: Python-based:
fi: Python-ohjelmointikieleen perustuva:
pt: Baseado em Python:

source: SymPy is written entirely in Python and uses Python for its language.
fi: SymPy on kirjoitettu kokonaan Pythonilla ja käyttää Pythonia kielenään
pt: SymPy é escrito completamente em Python e usa Python para sua linguagem.

source: Lightweight:
fi: Kevyt:
pt: Leve:

source: SymPy only depends on <a href="http://mpmath.org/">mpmath</a>, a pure Python library for arbitrary floating point arithmetic, making it easy to use.
pt: SymPy somente depende em <a href="http://mpmath.org/">mpmath</a>, uma biblioteca Python pura para aritimética arbitrária de ponto flutuante, fazendo-o fácil de usar.

source: A library:
fi: Kirjasto:
pt: Uma biblioteca:

source: Beyond use as an interactive tool, SymPy can be embedded in other applications and extended with custom functions.
fi: Interaktiivisen työkalun lisäksi SymPy voidaan liittää muihin sovelluksiin ja sitä voidaan laajentaa kustomoiduilla funktioilla
pt: Acima do uso como uma ferramenta interativa, SymPy pode ser embutido em outros applicativos e extendido com funções personalizadas.

source: <a href="features.html">See SymPy's features</a>
fi: <a href="features.html">SymPyn ominaisuudet</a>
pt: <a href="features.html">Veja os recursos do SymPy</a>

source: Projects using SymPy
pt: Projetos usando SymPy

source: This is an (incomplete) list of projects that use SymPy. If you use SymPy in your project, please let us know on our <a href="https://groups.google.com/forum/#!forum/sympy">mailinglist</a>, so that we can add your project here as well.
pt: Esta é uma lista (incompleta) de projetos que usam o SymPy. Se você usa o SymPy em seu projeto, por favor nos informe na nossa <a href="https://groups.google.com/forum/#!forum/sympy">lista de emails</a>, para nós podermos adicionar o seu projeto aqui também.

source: Tensor algebra and (quantum) field theory system using SymPy for scalar algebra.
pt: Álgebra tensorial e sistema de teoria (quântica) de campos usando SymPy para álgebra escalar.

source: Open source mathematics system that includes SymPy.
pt: Sistema de matemática open source que inclui SymPy.

source: Multibody dynamics in Python.
pt: Dinâmica multicorpo em Python

source: Geometric algebra (previously sympy.galgebra).
pt: Algebra Geométrica (préviamente sympy.galgebra).

source: Python package for analyzing and visualizing volumetric data (<a href="https://unyt.readthedocs.io">unyt</a>, the yt unit system, uses SymPy).
pt: Pacote Python para analizar e vizualizar dados volumétricos (<a href="https://unyt.readthedocs.io">unyt</a>, o sistema de unidades yt, usa o SymPy).

source: Simple finite elements in Python.
pt: Elementos finitos simples em Python.

source: Quameon
pt: Quaemon

source: Quantum Monte Carlo in Python.
pt: Monte Carlo quântico em Python.

source: Experimental Python package for teaching linear circuit analysis.
pt: Pacote experimental Python para ensino de análise de circuito linear.

source: Quantum Programming in Python
pt: Programação Quântica em Python

source: Quantum 1D Simple Harmonic Oscillator and Quantum Mapping Gate.
pt: Ocilador Harmônico Quântico Simples Monodimensional e Portão de Mapeamento Quântico.

source: LaTeX Expression project
pt: Projeto LaTeX Expression

source: Easy LaTeX typesetting of algebraic expressions in symbolic form with automatic substitution and result computation).
pt: Formatação LaTeX fácil de expressões algébricas na forma simbólica com sugestão automática e cálculo do resultado.

source: Symbolic statistical modeling
pt: Modelamento Estatístico Simbólico

source: Adding statistical operations to complex physical models.
pt: Adicionando operações estatísticas à modelos físicos completos.

source: A Symbolic Package for Octave using SymPy
pt: Um Pacote Simbólico para Octave usando SymPy.

source: Straightforward numerical integration of ODE systems from Python.
pt: Integração numérica de sistemas ODE direto do Python.

source: Solve symbolically defined systems of non-linear equations numerically.
pt: Resolve numericamente os sistemas definidos simbolicamente de equações não lineares.

source: A package useful for chemistry written in Python.
pt: Um pacote útil para química escrito em Python.

source: The Scientific Python Development Environment, a Python equivalent to Rstudio or MATLAB; full SymPy support can be enabled in Spyder's <a href="https://docs.spyder-ide.org/ipythonconsole.html">IPython Consoles</a>.
pt: O Ambiente de Desenvolvimento Científico com Python, um Python equivalente a Rstudio ou MATLAB; Suporte completo ao SymPy pode ser ativado no <a href="https://docs.spyder-ide.org/ipythonconsole.html">Console IPython</a> do Spyder.

source: News
fi: Uutisia
fr: Actualité
pt: Notícias
ru: Новости

source: Version %(v)s released
fi: Versio %(v)s julkaistu
fr: Sortie de la version %(v)s
pt: Versão %(v)s lançada
ru: Релиз версии %(v)s

source: changes
fi: muutokset
fr: changements
pt: mudanças
ru: изменения

source: SymPy is accepted as a <a href="https://www.google-melange.com/archive/gsoc/2014/orgs/sympy">mentoring organization</a> for Google Summer of Code 2014
pt: O SymPy é aceito como uma <a href="https://www.google-melange.com/archive/gsoc/2014/orgs/sympy">organização mentora</a> para o Google Summer of Code 2014

source: SymPy is accepted as a <a href="https://www.google-melange.com/archive/gsoc/2013/orgs/sympy">mentoring organization</a> for Google Summer of Code 2013
pt: O SymPy é aceito como uma <a href="https://www.google-melange.com/archive/gsoc/2013/orgs/sympy">organização mentora</a> para o Google Summer of Code 2013

source: SymPy is accepted as a <a href="https://www.google-melange.com/archive/gsoc/2012/orgs/sympy">mentoring organization</a> for Google Summer of Code 2012
pt: O SymPy é aceito como uma <a href="https://www.google-melange.com/archive/gsoc/2012/orgs/sympy">organização mentora</a> para o Google Summer of Code 2012

source: SymPy is accepted as a <a href="https://www.google-melange.com/archive/gsoc/2011/orgs/sympy">mentoring organization</a> for Google Summer of Code 2011
pt: O SymPy é aceito como uma <a href="https://www.google-melange.com/archive/gsoc/2011/orgs/sympy">organização mentora</a> para o Google Summer of Code 2011

source: New website launched at sympy.org
fi: Uusi Internet-sivusto julkaistu osoitteessa sympy.org
fr: Nouveau site web lancé à sympy.org
pt: Novo website lançado em sympy.org
ru: Новый сайт запущен на sympy.org

source: Final page about the <a href="%(url)s">2010 Google Summer of Code in SymPy</a> is available.
fi: Lopullinen <a href="%(url)s">SymPyn 2010 Google Summer of Code</a> - sivu on julkaistu
pt: Página final sobre o <a href="%(url)s">2010 Google Summer of Code do SymPy</a> está disponível.

source: Final page about the <a href="%(url)s">2009 Google Summer of Code in SymPy</a> is available.
fi: Lopullinen <a href="%(url)s">SymPyn 2009 Google Summer of Code</a> - sivu on julkaistu
fr: La page finale pour le <a href="%(url)s">Google Summer of Code 2009 de SymPy</a> est disponible.
pt: Página final sobre o <a href="%(url)s">2009 Google Summer of Code do SymPy</a> está disponível.
ru: Доступна отчётная страница об участии SymPy в <a href="%(url)s">Google Summer of Code 2009</a>

source: Broadly speaking, any form of purely symbolic mathematical computation is in scope for SymPy. However, there are a few things we plan to focus our development efforts on.
pt: De um modo geral, qualquer forma de computação matemática puramente simbólica está no objetivo do SymPy. No entanto, há algumas coisas que nós planejamos focar nossos esforços de desenvolvimento.

source: The Assumptions System
pt: O Sistema de Suposições

source: The assumptions system handles how SymPy makes assumptions on expressions and does logical inference and simplification based on those assumptions (for instance, assuming an expression is "positive" or "integer"). The SymPy assumptions system is currently in a state of disarray, as there is a "new" system and an "old" system that need to be properly merged. However, because assumptions affect every part of the codebase, this is a challenging task.
pt: O sisema de suposições manipula como o SymPy faz as suposições em expressões e tem uma interferência lógica e simplificações baseadas nessas suposições (por exemplo, supondo que uma expressão é "positiva" ou "inteira"). O sistema de suposições do SymPy está atualmente em um estado de desordem, como tem um sistema "novo" e um sistema "antigo" que precisam ser mesclados adequadamente. No entanto, como as suposições afetam todas as partes da base do código, essa é uma tarefa desafiadora.

source: Code Generation
pt: Geração de Código

source: Code generation refers to the task of converting SymPy expressions into another language, such as C or Fortran, for the purposes of fast numerical evaluation. The goal with code generation is to be able to use SymPy to model a problem symbolically, and then seamlessly convert that symbolic model into fast code that can be numerically evaluated on real data. Our roadmap for code generation is to make that translation as seamless as possible, through things like higher level abstractions that reduce the amount of work needed by the end user, an optimization pipeline, which would allow SymPy to take advantage of its mathematical knowledge to create faster and more accurate code, and more tools to help solve domain specific problems.
pt: Geração de código refere à tarefa de converter expressões SymPy em outta linguagem, como C ou Fortran, com o propósito de calculos numéricos rápidos. O objetivo com geração de código é ser capaz de usar SymPy para modelar um problema simbolicamente, e então converter esse modelo simbólico em código rápido que pode ser calculado numericamente em dados reais. Nossa roadmap para geração de código é fazer essa tradução o mais simples possível, atrávez de coisas como abstrações de alto nível que reduzem a quantidade de trabalho necessária pelo usuário final, uma segmentação de instruções de optimização, que permitiria o SymPy tomar vantagem de todo seu conhecimento matemático para criar código mais ráṕido e mais correto, e mais ferramentas para ajudar resolver problemas de domínio específico.

source: Performance
pt: Desempenho

source: Performance is an important aspect in symbolic computation. SymPy often suffers in terms of performance due to it being written in pure Python. There are a few ways that SymPy can be made more performant. One is to more carefully benchmark and profile SymPy code, so that inefficiencies can be rooted out. This includes tooling to prevent performance regressions from ever occurring in the first place. Second is to have a fast symbolic core that can be optionally plugged in to make SymPy's core operations faster. The plan is to use the <a href="https://github.com/symengine/symengine">SymEngine</a> library as an optional fast symbolic core for SymPy. SymEngine is a symbolic library written in C++, with an emphasis on performance. A third way SymPy can be made more performant is by implementing faster symbolic algorithms for various computations (see below).
pt: Desempenho é um aspecto importante em computação simbólica. O SymPy geralmente sofre em termos de desempenho devido a ser escrito em Python puro. Há alguns modos que SymPy pode obter melhor desempenho. Um deles é fazer um benchmark e um perfil mais cuidadoso do código SymPy, para que as ineficiencias possam ser erradicadas. Isso inclui ferramentas para evitar regressões de desempenho de ocorrer em primeiro lugar. O segundo é ter um núcleo simbólico rápido que pode ser opcionalmente conectado para fazer as operações do núcleo do SymPy mais rápidas. O plano é usar a biblioteca <a href="https://github.com/symengine/symengine">SymEngine</a> como um núcleo simbólico rápido opicional para o SymPy. A SymEngine é uma biblioteca simbólica escrita em C++, com uma ênfase em desempenho. Um terceiro modo de deixar o SymPy com melor desempenho é implementando algorítmos simbólicos mais rápidos para vários cálculos (veja abaixo).

source: SymPy Live and SymPy Gamma
pt: SymPy Live e SymPy Gamma

source: <a href="https://live.sympy.org/">SymPy Live</a> is a web application that runs a full SymPy Python session in the browser. It can be used standalone, and is also used in the <a href="https://docs.sympy.org/latest/index.html">SymPy documentation</a> to allow readers to interactively evaluate the documentation examples. The backend of SymPy Live needs modernization, and there are several possible improvements for the frontend as well.<p><p><a href="https://gamma.sympy.org/">SymPy Gamma</a> is a web application that takes a mathematical formula and performs many useful calculations on it, such as plotting, solving, simplifying, and symbolic integration. The goal of SymPy Gamma is to be an open source competitor to things like <a href="https://wolframalpha.com/">WolframAlpha</a>. We aim to improve SymPy Gamma by adding more useful computations to the output, and by improving the parsing so that users do not need to know SymPy syntax to use it.
pt: O <a href="https://live.sympy.org/">SymPy Live</a> é um aplicativo web que roda uma sessão SymPy Python completa no navegador. Ele pode ser usado sozinho, e também é usado na <a href="https://docs.sympy.org/latest/index.html">Documentação SymPy</a> para permitir que leitores calculem interativamente os exemplos da documentação. O backend do SymPy Live precisa ser modernizado, e há várias melhorias no frontend também. <p><p>O <a href="https://gamma.sympy.org/">SymPy Gamma</a> é um aplicativo web que recebe uma fórmula matemática e faz muitos cálculos úteis nela, como desenhar o gráfico, resolver, simplificar, e inegração simbólica. A meta do SymPy Gamma é ser um competidor open source de coisas como <a href="https://wolframalpha.com/">WolframAlpha</a>. Nós almejamos melhorar o SymPy Gamma adicionando mais calculos úteis à saída, melhorando a análise de sintaxe para que os usuários nçao precisam saber a sintaxe do SymPy para usá-lo.

source: Algorithmic Improvements
pt: Melhorias Algorítmicas

source: SymPy depends on a large array of symbolic computation algorithms to work. Many algorithms are already implemented, but quite a few are not. These include things like improved algorithms for symbolic integration, summations, simplification, polynomial manipulation, and equation solving, among many others. Improved algorithms will both increase the number of symbolic computations that SymPy is able to successfully compute, and, in many cases, greatly improve the performance of existing algorithms. A good resource for the sorts of things we want to implement is our <a href="https://github.com/sympy/sympy/wiki/GSoC-2017-Ideas">Google Summer of Code ideas page</a>.
pt: O SymPy depende numa vasta lista algorítmos de computação simbólica para funcionar. Muitos algorítmos já foram implementados, mãs alguns não. Esses incluem coisas como algorítmos melhorados para integração simbólica, somatórios, simplificação, manipulação polinomial, e resolução de equação, entre muitos outros. Algorítimos melhorados irão melhorar o número de cálculos simbólivos que o SymPy é capaz de calcular com sucesso, e em muitos casos melhorar muito o desempenho de um algorítmo existente. Um bom recurso para os tipos de coisas que queremos implementar é nossa <a href="https://github.com/sympy/sympy/wiki/GSoC-2017-Ideas">Página de ideias Google Summer of Code</a>.

source: General Improvements
pt: Melhorias Gerais

source: Aside from the above specific items, we are always aiming to improve SymPy in many ways. This includes things like <ul><li>fixing bugs</li><li>better documentation</li><li>improved development tooling</li><li>new features</li><li>better community outreach</li></ul>
pt: Além dos itens especificados acima, nós estamos sempre almejando em melhorar o SymPy em diversas maeiras. Isso inclui coisas como: <ul><li>corrigindo bugs</li><li>melhor documentação</li><li>ferramentas de desenvolvimento melhoradas</li><li>novos recursos</li><li>melhor alcance da comunidade</li></ul>

source: General
fi: Yleistä
fr: Général
pt: Geral
ru: Общие

source: Below you can find several ways to get help
fi: Alla olevista linkeistä voit löytää useita tapoja saada apua
fr: Vous trouverez ci-dessous plusieurs façons d'obtenir de l'aide
pt: Abaixo você encontra vários modos de obter ajuda
ru: Получить помощь можно следующими способами

source: SymPy <a href="https://docs.sympy.org">Documentation</a>
pt: <a href="https://docs.sympy.org">Documentação</a> do SymPy

source: Main <a href="https://groups.google.com/forum/#!forum/sympy">mailinglist</a>
pt: <a href="https://groups.google.com/forum/#!forum/sympy">mailinglist</a> Principal

source: <a href="https://github.com/sympy/sympy/issues/">Issue tracker</a>.
pt: <a href="https://github.com/sympy/sympy/issues/">Rastreador de problemas</a>.

source: Gitter channel: <a href="https://gitter.im/sympy/sympy">#sympy at Gitter</a>.
pt: Canal no Gitter: <a href="https://gitter.im/sympy/sympy">#sympy no Gitter</a>.

source: Stack Overflow: <a href="https://stackoverflow.com/questions/tagged/sympy">[sympy] tag</a>.
pt: Stack Overflow: <a href="https://stackoverflow.com/questions/tagged/sympy">tag [sympy]</a>.

source: More Specific
fi: Tarkemmin
fr: Plus spécifique
pt: Mais específico
ru: Также можете прочитать:

source: SymPy <a href="https://docs.sympy.org/latest/tutorial/index.html">tutorial</a>
pt: <a href="https://docs.sympy.org/latest/tutorial/index.html">Tutorial do SymPy</a>

source: Main <a href="https://github.com/sympy/sympy/wiki/Faq">FAQ</a>
fi: Pääasiallinen <a href="https://github.com/sympy/sympy/wiki/Faq">FAQ</a>
pt: <a href="https://github.com/sympy/sympy/wiki/Faq">FAQ</a> principal

source: <a href="https://docs.sympy.org/latest/gotchas.html">Gotchas and Pitfalls</a>
pt: <a href="https://docs.sympy.org/latest/gotchas.html">Armadilhas e Pegadinhas</a>

source: Download
fi: Lataa
fr: Télécharger
ru: Скачать

source: Official SymPy blog
fi: Virallinen SymPy-blogi
fr: Blog officiel de SymPy
ru: Официальный блог SymPy

source: Chat (Gitter)
fi: Gitter-Chat

source: If you found a bug (or just want to let us know what you think), tell us on the <a href="http://groups.google.com/group/sympy">mailinglist</a>
fi: Mikäli havaitsit bugin (tai haluat meidän tietävän mitä ajattelet), kerro meille <a href="http://groups.google.com/group/sympy">postituslistalla</a>
